Repository: Lingmo-Archive/lingmo-kde-cli-tools
Catalog: po/*/kioclient5.po
Languages: az, fr, ia, ko, nl

# NAME OF TRANSLATORS
source: Your names
az: Xəyyam Qocayev
fr: Vincent Pinon, Xavier Besnard
ia: Giovanni Sora
ko: 박신조
nl: Freek de Kruijf - t/m 2020

# EMAIL OF TRANSLATORS
source: Your emails
az: xxmn77@gmail.com
fr: vpinon@kde.org, xavier.besnard@neuf.fr
ia: g.sora@tiscali.it
ko: kde@peremen.name
nl: freekdekruijf@kde.nl

source: Syntax:
az: Söz düzümü:
fr: Syntaxe :
ia: Syntaxe:
ko: 문법:
nl: Gebruik:

source: kioclient5 openProperties 'url' # Opens a properties menu
az: kioclient5 openProperties 'url' # Xüsusiyyətlər menyusu açılır
fr: kioclient openProperties « URL » # Ouvre un menu de propriétés
ia: kioclient openProperties 'url' # Il aperi un menu de proprietates
ko: kioclient5 openProperties 'url' # 속성 메뉴를 엽니다
nl: kioclient5 openProperties 'URL-adres' # Opent een eigenschappenmenu

source: kioclient5 exec 'url' ['mimetype'] # Tries to open the document pointed to by 'url', in the application # associated with it in KDE. You may omit 'mimetype'. # In this case the mimetype is determined # automatically. Of course URL may be the URL of a # document, or it may be a *.desktop file. # 'url' can be an executable, too.
az: kioclient5 exec 'url' ['mime növü'] # 'url' ünvanındakı faylları KDE-dəki ona aid proqramdan # istifadə edərək acmağa cəhd edir # İstəsəniz mime növü təyin etməyə bilərsiniz. Bu halda # mime növü avtomatik təyin olunacaqdır # 'url' hər hansı bir fayl ola biləcəyi kimi bir iş masası və # ya bir icra edilə bilən fayl da ola bilər.
fr: kioclient exec « URL » [ « type-mime » ] # Essaie d'ouvrir le document vers lequel pointe l'URL dans l'application # qui lui est associée dans KDE. Vous pouvez omettre « type-mime ». # Dans ce cas, le type « MIME » est déterminé # automatiquement. Bien entendu, l'URL peut être l'emplacement d'un # document ou d'un fichier « *.desktop ». # « URL » peut également être un exécutable.
ia: kioclient exec 'url' ['mimetype'] # Il prova a aperir le documento punctate per 'url', in le application # associate con illo in KDE. Tu pote omitter 'mimetype'. # In iste caso le mimetype es determinate # automaticamente. URL pote esser le URL de un # documento, o il pote esser un file *.desktop . # 'url' pote anque esser un file executable.
ko: kioclient5 exec 'url' ['mimetype'] # 'url'이 가리키는 문서를 KDE에 연결된 프로그램으로 # 엽니다. 'mimetype'은 생략할 수 있으며, 이 경우 # MIME 형식은 자동으로 추측합니다. URL은 문서를 # 가리키거나, *.desktop 파일일 수 있습니다.
nl: kioclient5 exec 'URL-adres' ['mime-bestandstype'] # probeert het document waarnaar 'URL-adres' wijst te # openen in het programma dat ermee is geassocieerd # in KDE. U mag 'mime-bestandstype' weglaten. # In dat geval wordt het mime-bestandstype automatisch # bepaald. Uiteraard mag URL-adres het adres van een # document zijn of een *.desktop-bestand. # URL-adres mag ook een uitvoerbaar bestand zijn.

source: kioclient5 move 'src' 'dest' # Moves the URL 'src' to 'dest'. # 'src' may be a list of URLs.
az: kioclient5 move 'təyinat' # Bir və ya birən çox faylları göstərilən. # təyinat yerinə köçürmək.
fr: kioclient move « src » « dest » # Déplace l'URL « src » vers « dest ». # « src » peut être une liste d'URL.
ia: kioclient move 'src' 'dest' # Il move le URL 'src' a 'dest'. # 'src' pote esser un lista de URLs.
ko: kioclient5 move 'src' 'dest' # URL 'src'를 'dest'로 이동합니다. # 'src'는 URL 목록일 수 있습니다.
nl: kioclient5 move 'bron' 'bestemming' # verplaatst het URL-adres 'bron' naar 'bestemming'. # 'bron' mag een lijst van URL-adressen zijn.

source: # 'dest' may be "trash:/" to move the files # to the trash.
az: # 'təyinat' faylları atmaq üçün "səbət:/"ola bilər
fr: # « dest » peut être « trash:/ » pour déplacer les fichiers # vers la corbeille.
ia: # 'dest' pote esser "trash:/" pro mover le files # a le corbe.
ko: # 'dest'에 "trash:/"를 사용하면 파일을 # 휴지통으로 이동합니다.
nl: # 'bestemming' mag "trash:/" zijn om de bestanden naar # de prullenbak te verplaatsen.

source: # the short version kioclient5 mv # is also available.
az: # həmçinin qısaldılmış "kioclient5 mv" # istifadə etmək olar.
fr: # la version courte « kioclient5 mv » # est aussi disponible.
ia: # le version breve kioclient mv # es etiam disponibile.
ko: # 짧은 버전 kioclient5 mv를 # 사용해도 됩니다.
nl: # 'de korte versie van kioclient5 mv # is ook beschikbaar.

source: kioclient5 download ['src'] # Copies the URL 'src' to a user-specified location'. # 'src' may be a list of URLs, if not present then # a URL will be requested.
az: kioclient5 download ['mənbə'] # Bir çox faylları göstərilən qovluğa kopyalamaq # Əgər mənbə göstərilməyibsə onu təyin etmək # üçün dialoq pəncərəsi açılacaq.
fr: kioclient5 download [ « src » ] # Copie l'URL « src » vers un emplacement spécifié par l'utilisateur. # « src » peut être une liste d'URL. Si elle n'est pas fournie alors # une URL sera demandée.
ia: kioclient download ['src'] # Il copia le URL 'src' a le location specificate per le usator'. # 'src' pote esser un lista de URLs, si il non es presente # tunc un URL essera demandate.
ko: kioclient5 download ['src'] # URL 'src'를 사용자가 지정한 위치에 복사합니다. # 'src'는 URL의 목록일 수 있으며, 지정하지 않은 경우 # 사용자에게 물어 봅니다.
nl: kioclient5 download ['bron'] # kopieert het URL-adres 'bron' naar een door de gebruiker # opgegeven locatie. # 'bron' mag een lijst van URL-adressen zijn. Indien niet # gegeven zal er om een URL-adres worden gevraagd.

source: kioclient5 copy 'src' 'dest' # Copies the URL 'src' to 'dest'. # 'src' may be a list of URLs.
az: kioclient5 copy 'mənbə' 'təyinat' # Bir çox faylları göstərilən # təyinat yerinə kopyalamaq
fr: kioclient5 copy « src » « dest » # Copie l'URL « src » vers « dest ». # « src » peut être une liste d'URL.
ia: kioclient copy 'src' 'dest' # Il Copia le URL 'src' a 'dest'. # 'src' pote esser un lista de URLs.
ko: kioclient5 copy 'src' 'dest' # URL 'src'를 'dest'로 복사합니다. # 'src'는 URL 목록일 수 있습니다.
nl: kioclient5 copy 'bron' 'bestemming' # kopieert het URL-adres 'bron' naar 'bestemming'. # 'bron' mag een lijst van URL-adressen zijn.

source: # the short version kioclient5 cp # is also available.
az: # Həmçinin "kioclient5 cp" əmrinin # qısaldılmış variantı mövcuddur
fr: # la version courte « kioclient5 cp » # est aussi disponible.
ia: # le version breve kioclient cp # es etiam disponibile.
ko: # 짧은 버전 kioclient5 cp를 # 사용해도 됩니다.
nl: # de korte versie van kioclient5 cp # is ook beschikbaar.

source: kioclient5 cat 'url' # Writes out the contents of 'url' to stdout
az: kioclient5 cat 'url' # 'Ünvanın' satndart çıxışının tərkiblərini yazır
fr: kioclient5 cat « URL » # Affiche les contenus de l'URL sur le périphérique de sortie
ia: kioclient cat 'url' # Il monstra le contentos del 'url' a stdout
ko: kioclient5 cat 'url' # 'url'의 내용을 표준 출력으로 씁니다
nl: kioclient5 cat 'URL-adres' # Schrijft de inhoud van 'URL-adres' naar stdout

source: kioclient5 ls 'url' # Lists the contents of the directory 'url' to stdout
az: kioclient5 ls 'url' # 'Ünvan' -dakı qovluğun tərkibini standart çıxışa sıralayın
fr: kioclient5 ls « URL » # Affiche les contenus de l'URL sur le périphérique de sortie
ia: kioclient es 'url' # Il lista le contentos del directorio 'url' a stdout
ko: kioclient5 ls 'url' # 'url'이 가리키는 디렉터리의 내용을 표준 출력으로 씁니다
nl: kioclient5 ls 'url' # Schrijft de inhoud van de map 'url' naar stdout

source: kioclient5 remove 'url' # Removes the URL # 'url' may be a list of URLs.
az: kioclient5 remove 'url' # URL ünvanını silir # 'url' bir URL-lar siyahısı ola bilər
fr: kioclient5 remove « URL » # Supprime l'URL # « URL » peut être une liste d'URL.
ia: kioclient remove 'url' # Il remove le URL # 'url' pote esser un lista de URLs.
ko: kioclient5 remove 'url' # URL을 삭제합니다. # 'url'은 URL 목록일 수 있습니다.
nl: kioclient5 remove 'url' # verwijdert het URL-adres # 'url' mag een lijst van URL-adressen zijn.

source: # the short version kioclient5 rm # is also available.
az: # Həmçinin "kioclient5 cp" əmrinin # qısaldılmış variantı mövcuddur
fr: # la version courte « kioclient5 rm » # est aussi disponible.
ia: # le version breve kioclient rm # es anque disponibile.
ko: # 단축 명령으로 kioclient5 rm을 # 사용할 수 있습니다.
nl: # de korte versie kioclient5 rm # is ook beschikbaar.

source: *** Examples:
az: *** Nümunələr:
fr: *** Exemples :
ia: *** Exemplos:
ko: *** 예제:
nl: *** Voorbeelden:

source: kioclient5 exec file:/home/weis/data/test.html // Opens the file with default binding
az: kioclient5 exec file:/home/weis/data/test.html
fr: kioclient5 exec file:/home/weis/data/test.html // Ouvre le fichier avec l'application par défaut
ia: kioclient exec file:/home/weis/data/test.html // il aperi file con ligamine (binding) predefinite
ko: kioclient5 exec file:/home/weis/data/test.html // 기본 바인딩으로 파일을 엽니다
nl: kioclient5 exec file:/home/gebruiker/data/test.html // opent het bestand met de standaardassociatie

source: kioclient5 exec ftp://localhost/ // Opens new window with URL
az: kioclient5 exec ftp://localhost/ // Yeni pəncərəni URL ilə açın
fr: kioclient5 exec ftp://localhost/ // Ouvre une nouvelle fenêtre avec l'URL
ia: kioclient exec ftp://localhost/ // il aperi nove fenestra con URL
ko: kioclient5 exec ftp://localhost/ // URL을 새 창으로 엽니다
nl: kioclient5 exec ftp://localhost/ // opent een nieuw venster met het URL-adres

source: kioclient5 exec file:/root/Desktop/emacs.desktop // Starts emacs
az: kioclient5 exec file:/root/Desktop/emacs.desktop // emacs başladılır
fr: kioclient5 exec file:/root/Desktop/emacs.desktop // Démarre « emacs »
ia: kioclient exec file:/root/Desktop/emacs.desktop // il initia emacs
ko: kioclient5 exec file:/root/Desktop/emacs.desktop // 이맥스를 시작합니다
nl: kioclient5 exec file:/home/gebruiker/Desktop/emacs.desktop // start het programma Emacs

source: kioclient5 exec . // Opens the current directory. Very convenient.
az: kioclient5 exec . // Cari qovluq açılır. Çox istifadəli.
fr: kioclient5 exec . // Ouvre le dossier courant. Très commode.
ia: kioclient exec. // il aperi le directorio currente. Il es multe conveniente.
ko: kioclient5 exec . // 현재 디렉터리를 엽니다. 매우 편리합니다.
nl: kioclient5 exec . // opent de huidige map. Erg handig.

source: Command-line tool for network-transparent operations
az: Şəffaf şəbəkə əməliyyatları üçün əmrlər sətri
fr: Un outil en ligne de commandes pour les opérations réseau transparentes
ia: Instrumento de linea de commando pro operationes transparente de rete
ko: 네트워크 투명 작업용 명령행 도구
nl: Commandoregelprogramma voor netwerktransparante operaties

source: Use message boxes and other native notifications
az: İsmarıc qutusunu və digər bildirişləri çatdırma vasitələrini istifadə etmək
fr: Utiliser les boîtes de dialogue et autres notifications natives
ia: Usa quadratos de message e altere notificationes native
ko: 메시지 상자와 다른 네이티브 알림 사용
nl: Berichtvelden en andere gebruikelijke meldingen gebruiken

source: Non-interactive use: no message boxes. If you don't want a graphical connection, use --platform offscreen
az: Qeyri-interaltiv istifadə: ismarıc dialoqları yoxdur. Əgər qrafik altsistem olmadan qoşulmaq istəsəniz --platform offscreen əmrini istifadə edin
fr: Utilisation non interactive : aucune boîte de dialogue. Si vous ne voulez aucune connexion graphique, utilisez « --platform offscreen »
ia: Uso non interactive: necun quadratos de message.Si tu non vole un connexion graphic, usa --platform offscreen
ko: 대화식 모드 사용하지 않기: 메시지 상자 없음. 그래픽 연결을 사용하지 않으려면 --platform offscreen을 사용하십시오
nl: Niet-interactief gebruik: geen berichtvelden. Als u geen grafische verbinding wilt, gebruik --platform offscreen

source: Overwrite destination if it exists (for copy and move)
az: Mövcud olan faylı əvəz etmək (kopyalamaq və köçürmək üç.)
fr: Écraser la destination si elle existe (pour la copie et le déplacement)
ia: Super scriber destination si illo existe (pro copiar e mover)
ko: 대상이 존재하면 덮어쓰기 (복사와 이동)
nl: Bestemming overschrijven als deze bestaat (voor kopiÃ«ren en verplaatsten)

source: file or URL
az: Fayl və ya URL
fr: Fichier ou URL
ia: file o URL
ko: 파일 및 URL
nl: Bestand of URL-adres

source: urls...
az: ünvanlar...

source: Source URL or URLs
az: Mənbənin URL və ya URL-ları
fr: URL(s) de la source
ia: URL o URLs Fonte
ko: 원본 URL
nl: Bron-URL-adres(sen)

source: Destination URL
az: URL təyinat ünvanı
fr: URL de la destination
ia: URL de destination
ko: 대상 URL
nl: URL-adres van bestemming

source: url
az: ünvan

source: Show available commands
az: Mövcud əmrləri göstərmək
fr: Afficher les commandes disponibles
ia: Monstrar commandos disponibile
ko: 사용 가능한 명령 보기
nl: Beschikbare commando's tonen

source: Command (see --commands)
az: Əmr (mövcud olan əmrlər siyahısını --commands əmri ilə almaq olar)
fr: Commande (voir « --commands »)
ia: Commando (tu vide --commands)
ko: 명령 (--commands 참고)
nl: Commando (zie --commands)

source: command
az: əmr
fr: commande
ia: Commando:
nl: commando

source: Arguments for command
az: Əmr üçün arqumentlər
fr: Paramètres de la commande
ia: Argumentos pro commando
ko: 명령의 인자
nl: Argumenten voor commando

# @info:shell
source: %1: Syntax error, not enough arguments
az: %1: Söz düzümü xətası, kifayət qədər arqumentlər yoxdu
fr: %1 : erreur de syntaxe, pas assez de paramètres
ia: %1: Error de syntaxe: argumentos non bastante
ko: %1: 문법 오류: 인자가 충분하지 않음
nl: %1: Syntaxisfout: te weinig argumenten

# @info:shell
source: %1: Syntax error, too many arguments
az: %1: Söz düzümü xətası, arqumentlər həddindən çoxdur
fr: %1 : erreur de syntaxe, beaucoup trop de paramètres
ia: %1: Error de Syntaxe: troppo argumentos
ko: %1: 문법 오류: 인자가 너무 많음
nl: %1: Syntaxisfout: te veel argumenten

source: Destination where to download the files
az: Alınan faylların saxlanılacağı ünvan
fr: Destination vers laquelle télécharger les fichiers
ia: Destination ubi discargar le files
ko: 파일을 다운로드할 위치
nl: Bestemming waar vanaf de bestanden te downloaden

# @info:shell
source: %1: Syntax error, unknown command '%2'
az: %1: Söz düzümü xətası, naməlum əmr '%2'
fr: %1 : erreur de syntaxe, commande « %2 » inconnue
ia: %1: Error de Syntaxe: commando incognite '%2'
ko: %1: 문법 오류: 알 수 없는 명령 '%2'
nl: %1: Syntaxisfout: '%2' is een onbekend commando

source: KIO Client
ko: KIO 클라이언트
