Repository: Lingmo-Archive/lingmo-kde-cli-tools
Catalog: po/*/kstart5.po
Languages: id

# NAME OF TRANSLATORS
source: Your names
id: Andhika Padmawan

# EMAIL OF TRANSLATORS
source: Your emails
id: andhika.padmawan@gmail.com

source: Utility to launch applications with special window properties such as iconified, maximized, a certain virtual desktop, a special decoration and so on.
id: Utilitas untuk menjalankan aplikasi dengan properti window khusus seperti diikonkan, dimaksimalkan, desktop virtual tertentu, dekorasi khusus dan seterusnya.

source: Command to execute
id: Perintah untuk mengeksekusi

source: Optional URL to pass <desktopfile>, when using --service
id: URL opsional untuk meneruskan <berkasdesktop>, ketika menggunakan --service

source: A regular expression matching the window title
id: Ekspresi reguler yang cocok dengan judul window

source: A string matching the window class (WM_CLASS property) The window class can be found out by running 'xprop | grep WM_CLASS' and clicking on a window (use either both parts separated by a space or only the right part). NOTE: If you specify neither window title nor window class, then the very first window to appear will be taken; omitting both options is NOT recommended.
id: Benang yang cocok dengan kelas window (properti WM_CLASS) Kelas window dapat diketahui dengan menjalankan 'xprop | grep WM_CLASS' dan klik pada window (gunakan baik kedua bagian yang dipisahkan oleh spasi atau hanya bagian kanan. CATATAN: Jika anda tidak menentukan judul window atau kelas window, maka window pertama yang muncul akan diambil; menghapus kedua opsi TIDAK direkomendasikan.

source: Desktop on which to make the window appear
id: Desktop tempat untuk membuat window muncul

source: Make the window appear on the desktop that was active when starting the application
id: Buat window muncul di desktop yang aktif ketika menjalankan aplikasi

source: Make the window appear on all desktops
id: Buat window muncul di semua desktop

source: Iconify the window
id: Ikonkan window

source: Maximize the window
id: Maksimalkan window

source: Maximize the window vertically
id: Maksimalkan window secara menegak

source: Maximize the window horizontally
id: Maksimalkan window secara mendatar

source: Show window fullscreen
id: Tampilkan window layar penuh

source: The window type: Normal, Desktop, Dock, Toolbar, Menu, Dialog, TopMenu or Override
id: Tipe window: Normal, Desktop, Dok, Bilah Alat, Menu, Dialog, Menu Atas atau Timpa

source: Jump to the window even if it is started on a different virtual desktop
id: Lompat ke window bahkan jika dijalankan di desktop virtual yang berbeda

source: Try to keep the window above other windows
id: Coba untuk menjaga window di atas window lainnya

source: Try to keep the window below other windows
id: Coba untuk menjaga window di bawah window lainnya

source: The window does not get an entry in the taskbar
id: Jendela tidak mendapat tempat di taskbar

source: The window does not get an entry on the pager
id: Jendela tidak mendapat tempat di pemisah

source: No command specified
id: Tak ada perintah yang ditentukan
